#! /usr/bin/env ruby

class HindiStemmer

    def self.hi_stem(word)
        @hi_suffixes = {
            1 => ["ो", "े", "ू", "ु", "ी", "ि", "ा", "न", "ै", "त", "ा"],
            2 => ["कर", "ाओ", "िए", "ाई", "ाए", "ने", "नी", "ना", "ते", "ीं", "ती", "ता", "ाँ", "ां", "ों", "ें", "है", "हौ", "ीं"],
            3 => ["ाकर", "ाइए", "ाईं", "ाया", "ेगी", "ेगा", "ोगी", "ोगे", "ाने", "ाना", "ाते", "ाती", "ाता", "तीं", "ाओं", "ाएं", "ुओं", "ुएं", "ुआं", "हैं", "हौं", "निन"],
            4 => ["ाएगी", "ाएगा", "ाओगी", "ाओगे", "एंगी", "ेंगी", "एंगे", "ेंगे", "ूंगी", "ूंगा", "ातीं", "नाओं", "नाएं", "ताओं", "ताएं", "ियाँ", "ियों", "ियां"],
            5 => ["ाएंगी", "ाएंगे", "ाऊंगी", "ाऊंगा", "ाइयाँ", "ाइयों", "ाइयां"]
        }
        for lvl in [5, 4, 3, 2, 1]
            if word.length > lvl + 1
                for suf in @hi_suffixes[lvl]
                    if word.end_with? suf
                        return word[0..-(lvl+1)]
                    end
                end
            end
        end
        return word
    end

end
